; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-4-4)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	p0-1 - location
	p0-2 - location
	p2-0 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s2)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at package1 s1)
	(at package2 s2)
	(at package3 s0)
	(at package4 s1)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(link s0 s2)
	(link s2 s0)
	(link s1 s0)
	(link s0 s1)
	(link s2 s1)
	(link s1 s2)
)
	(:goal (and
	(at driver3 s1)
	(at package1 s0)
	(at package2 s1)
	(at package3 s0)
	(at package4 s0)
	))


)

; plan
1. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 1 of 5
2. (board-truck driver3 truck1 s2)
   deleted: (at driver3 s2) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 1 of 5
3. (drive-truck truck1 s2 s1 driver3)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 1 of 5
4. (unload-truck package2 truck1 s1)
   deleted: (in package2 truck1)
   added: (at package2 s1)
   goals met: 2 of 5
5. (load-truck package4 truck1 s1)
   deleted: (at package4 s1)
   added: (in package4 truck1)
   goals met: 2 of 5
6. (load-truck package1 truck1 s1)
   deleted: (at package1 s1)
   added: (in package1 truck1)
   goals met: 2 of 5
7. (disembark-truck driver3 truck1 s1)
   deleted: (driving driver3 truck1)
   added: (at driver3 s1) (empty truck1)
   goals met: 3 of 5
8. (board-truck driver2 truck1 s1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 3 of 5
9. (drive-truck truck1 s1 s0 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 3 of 5
10. (unload-truck package1 truck1 s0)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   goals met: 4 of 5
11. (unload-truck package4 truck1 s0)
   deleted: (in package4 truck1)
   added: (at package4 s0)
   goals met: 5 of 5
